Ebkosha/gr/system/StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_CDC.cpp
USB_Result USB_CDC_Reset(void)
{
  USB_Result result;

  /* Inherited handler call */
  result = USB_DeviceReset();

  if (result == USB_SUCCESS)
  {
    /* EP1, EP2 and EP3 initialization. Note: DATA1 bit would be toggled to DATA0 on the first
     * IN transaction */
    USB_EP_Init(USB_CDC_EP_SEND, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1,
                USB_CDC_HANDLE_SEND_ERROR);
    USB_EP_Init(USB_CDC_EP_STATE, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1,
                USB_CDC_HANDLE_LINE_STATE_REPORT_SEND_ERROR);
    USB_EP_Init(USB_CDC_EP_RECEIVE, USB_SEPx_CTRL_EPEN_Enable, 0);

    /* Start to listen for incoming data, if desired */
    if (USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS)
    {
      result = USB_EP_doDataOut(USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive);
    }
  }
  return result;
}

/**
  * @brief  GET_DESCRIPTOR standard request handler implementation for CDC.
  *
  * @param  wVALUE: Descriptor Type and Descriptor Index
  *
  * @param  wINDEX: Not used
  *
  * @param  wLENGTH: Amount of data host is willing to receive.
  *
  * @retval USB_Result.
  *
  * @note   This handler transmits to host an appropriate CDC descriptor data.
  */

USB_Result USB_CDC_GetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
  uint8_t* pDescr = 0;
  uint32_t length;
  USB_Result result = USB_SUCCESS;

  (void)wINDEX;

  /* Only 0 configuration is supported; for device request this field must be 0 */
  if ((wVALUE & 0xFF) != 0)
  {
    result = USB_ERROR;
  }
  else
  {
    switch (wVALUE >> 8)      /* Descriptor type */
    {
      case USB_DEVICE:
        pDescr = Usb_CDC_Device_Descriptor;
        length = 0x12;
        break;
      case USB_CONFIGURATION:
        pDescr = Usb_CDC_Configuration_Descriptor;
        length = 0x43;
        break;
      default:
        result = USB_ERROR;
    }
  }

  if (result == USB_SUCCESS)
  {
    if (length > wLENGTH)
    {
      length = wLENGTH;
    }
    result = USB_EP_doDataIn(USB_EP0, pDescr, length, USB_DeviceDoStatusOutAck);
  }
  return result;
}

/**
  * @brief  Class-type setup request handler for CDC.
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_ClassRequest(void)
{
  USB_Result result = USB_SUCCESS;

#if defined (USB_CDC_COMM_FEATURE_SUPPORTED) ||\
    defined (USB_CDC_CONTROL_LINE_STATE_SUPPORTED) ||\
    defined (USB_CDC_LINE_BREAK_SUPPORTED)
  uint16_t wValue = USB_CurrentSetupPacket.wValue;
  (void)wValue;
#endif
  uint16_t wIndex = USB_CurrentSetupPacket.wIndex,
           wLength = USB_CurrentSetupPacket.wLength;

  /* Specific requests */
  switch (USB_CurrentSetupPacket.bRequest)
  {
#ifdef USB_CDC_ENCAPSULATION_SUPPORTED
    /* SEND_ENCAPSULATED_COMMAND */
    case USB_CDC_SEND_ENCAPSULATED_COMMAND:
      result = USB_CDC_HANDLE_SEND_ENCAPSULATED_CMD(wIndex, wLength);
      break;
    /* GET_ENCAPSULATED_RESPONSE */
    case USB_CDC_GET_ENCAPSULATED_RESPONSE:
      result = USB_CDC_HANDLE_GET_ENCAPSULATED_RESP(wIndex, wLength);
      break;
#endif /* USB_CDC_ENCAPSULATION_SUPPORTED */

#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
    /* SET_COMM_FEATURE */
    case USB_CDC_SET_COMM_FEATURE:
      if (wLength == 2)
      {
        result = USB_EP_doDataOut(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut);
      }
      else
      {
        result = USB_ERR_INV_REQ;
      }
      break;
    /* GET_COMM_FEATURE */
    case USB_CDC_GET_COMM_FEATURE:
      if (wLength == 2)
      {
        result = USB_CDC_HANDLE_GET_COMM_FEATURE(wValue, wIndex, &CDC_ClassPacketData.CommFeature);
        if (result == USB_SUCCESS)
        {
          result = USB_EP_doDataIn(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_DeviceDoStatusOutAck);
        }
      }
      else
      {
        result = USB_ERR_INV_REQ;
      }
      break;
    /* CLEAR_COMM_FEATURE */
    case USB_CDC_CLEAR_COMM_FEATURE:
      result = USB_CDC_HANDLE_CLEAR_COMM_FEATURE(wValue, wIndex);
      break;
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_LINE_CODING_SUPPORTED
    /* SET_LINE_CODING */
    case USB_CDC_SET_LINE_CODING:
      if (wLength == 7)
      {
        result = USB_EP_doDataOut(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut);
      }
      else
      {
        result = USB_ERR_INV_REQ;
      }
      break;
    /* GET_LINE_CODING */
    case USB_CDC_GET_LINE_CODING:
      if (wLength == 7)
      {
        result = USB_CDC_HANDLE_GET_LINE_CODING(wIndex, &CDC_ClassPacketData.LineCoding);
        if (result == USB_SUCCESS)
        {
          result = USB_EP_doDataIn(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_DeviceDoStatusOutAck);
        }
      }
      else
      {
        result = USB_ERR_INV_REQ;
      }
      break;
#endif /* USB_CDC_LINE_CODING_SUPPORTED */

#ifdef USB_CDC_CONTROL_LINE_STATE_SUPPORTED
      /* SET_CONTROL_LINE_STATE */
      case USB_CDC_SET_CONTROL_LINE_STATE:
        result = USB_CDC_HANDLE_CONTROL_LINE_STATE(wValue, wIndex);
        break;
#endif /* USB_CDC_CONTROL_LINE_STATE_SUPPORTED */

#ifdef USB_CDC_LINE_BREAK_SUPPORTED
      /* SEND_BREAK */
      case USB_CDC_SEND_BREAK:
        result = USB_CDC_HANDLE_BREAK(wValue, wIndex);
        break;
#endif /* USB_CDC_LINE_BREAK_SUPPORTED */

      default:
        result = USB_ERROR;
  }
  /* If there were no DATA stage, initiate Status Stage (IN ACK) */
  if (result == USB_SUCCESS && wLength == 0)
  {
    result = (USB_CurrentSetupPacket.mRequestTypeData & 0x80) == USB_DEVICE_TO_HOST ?
                    USB_EP_doDataOut(USB_EP0, 0, 0, 0) :
                    USB_EP_doDataIn(USB_EP0, 0, 0, 0);
  }

  return result;
}

/** @} */ /* End of group USB_CDC_Private_Overwritten_Device_Handlers */

/**
  * @brief  Handler called when data is sent.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer with portion of data
  *                 sent
  *
  * @param  Length: Length of data portion
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */


static USB_Result USB_CDC_OnDataSent(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  (void)EPx;
  (void)Buffer;
  (void)Length;

  /* Release "busy" flag and call user's handler */
  USB_CDCContext.CDC_SendDataStatus = USB_SUCCESS;
  return USB_CDC_HANDLE_DATA_SENT;
}


/**
  * @brief  Handler called when some data is received.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer with received data
  *
  * @param  Length: Length of data
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */

static USB_Result USB_CDC_OnDataReceive(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  /* Call user's handler */
  USB_Result result = USB_CDC_HANDLE_DATA_RECEIVE(Buffer, Length);

