Ebkosha/gr/system/StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_CDC.cpp
  (void)EPx;

  /* If handler returns USB_SUCCESS, wait for another portion. Otherwise, stop to receive
   * incoming data */
  if (result != USB_SUCCESS)
  {
    USB_CDCContext.CDC_ReceiveDataStatus = USB_ERR_BUSY;
  }
  if (USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS)
  {
    return USB_EP_doDataOut(USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
              USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive);
  }
  else
  {
    return USB_SUCCESS;
  }
}


/**
  * @brief Implements Data stage of Setup transaction with OUT data stage
  *        for Class-Specific requests with data processing on CDC layer.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer with portion of data
  *                 to be sent
  *
  * @param  Length: Length of data portion
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */

static USB_Result USB_CDC_DoDataOut(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  USB_Result result;

  (void)Length;

  switch (USB_CurrentSetupPacket.bRequest)
  {
#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
    /* USB_CDC_SET_COMM_FEATURE */
    case USB_CDC_SET_COMM_FEATURE:
      /* Call user's handler */
      result = USB_CDC_HANDLE_SET_COMM_FEATURE(USB_CurrentSetupPacket.wValue,
                                               USB_CurrentSetupPacket.wIndex,
                                               *((uint16_t*)Buffer));
      break;
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */
#ifdef USB_CDC_LINE_CODING_SUPPORTED
    /* USB_CDC_SET_LINE_CODING */
    case USB_CDC_SET_LINE_CODING:
      /* Call user's handler */
      result = USB_CDC_HANDLE_SET_LINE_CODING(USB_CurrentSetupPacket.wIndex,
                                              (const USB_CDC_LineCoding_TypeDef*)Buffer);
      break;
#endif /* USB_CDC_LINE_CODING_SUPPORTED */
    default:
      result = USB_ERR_INV_REQ;
  }
  /* Initiate Status Stage */
  return result == USB_SUCCESS ? USB_EP_doDataIn(EPx, 0, 0, 0) : result;
}

/** @defgroup USB_CDC_Private_Dummy_Functions USB CDC Handlers implementation
  * @{
  */

/**
  * @brief  The sample of handler called when data is received from host.
  *
  * @param  Buffer: Pointer to buffer containing data (same as ReceiveBuffer)
  *
  * @param  Length: Received data length
  *
  * @retval USB_Result. If USB_SUCCESS is returned, the device continues
  *         to receive incoming data, stops otherwise.
  *
  */

USB_Result USB_CDC_DummyDataReceive(uint8_t* Buffer, uint32_t Length)
{
  (void)Buffer;
  (void)Length;

  return USB_ERROR;
}

/**
  * @brief  The sample of handler called when data sending is complete
  *         (successfully or with error)
  *
  * @retval USB_Result.
  *
  */

USB_Result USB_CDC_DummyDataSent(void)
{
  return USB_ERROR;
}

#ifdef USB_CDC_ENCAPSULATION_SUPPORTED
/**
  * @brief  SEND_ENCAPSULATED_COMMAND class-specific packet handler sample ([1], 6.2.1).
  *
  * @param  wINDEX: Interface number
  *
  * @param  wLENGTH: Amount of data
  *
  * @retval USB_Result.
  *
  * @note   The handler is expected to either perform data transfer and status
  *         stages on its own (calling USB_EP_doDataOut), or return value
  *         that is not USB_SUCCESSS.
  */

USB_Result USB_CDC_DummySendEncapsulatedCMD(uint16_t wINDEX, uint16_t wLENGTH)
{
  (void)wINDEX;
  (void)wLENGTH;

  return USB_ERROR;
}

/**
  * @brief  GET_ENCAPSULATED_RESPONSE class-specific packet handler sample ([1], 6.2.2).
  *
  * @param  wINDEX: Interface number
  *
  * @param  wLENGTH: Amount of data
  *
  * @retval USB_Result.
  *
  * @note   The handler is expected to either perform data transfer and status
  *         stages on its own (calling USB_EP_doDataIn), or return value
  *         that is not USB_SUCCESSS.
  */

USB_Result USB_CDC_DummyGetEncapsulatedResp(uint16_t wINDEX, uint16_t wLENGTH)
{
  (void)wINDEX;
  (void)wLENGTH;

  return USB_ERROR;
}
#endif /* USB_CDC_ENCAPSULATION_SUPPORTED */

#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
/**
  * @brief  GET_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.2).
  *
  * @param  wVALUE: Feature selector
  *
  * @param  wINDEX: Interface number
  *
  * @param  DATA: Place for the value of current setting.
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummyGetCommFeature(uint16_t wVALUE, uint16_t wINDEX, uint16_t* DATA)
{
  (void)wVALUE;
  (void)wINDEX;
  (void)DATA;

  return USB_ERROR;
}

/**
  * @brief  SET_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.1).
  *
  * @param  wVALUE: Feature selector
  *
  * @param  wINDEX: Interface number
  *
  * @param  DATA: Value to be set.
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummySetCommFeature(uint16_t wVALUE, uint16_t wINDEX, uint16_t DATA)
{
  (void)wVALUE;
  (void)wINDEX;
  (void)DATA;

  return USB_ERROR;
}

/**
  * @brief  CLEAR_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.3).
  *
  * @param  wVALUE: Feature selector
  *
  * @param  wINDEX: Interface number
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummyClearCommFeature(uint16_t wVALUE, uint16_t wINDEX)
{
  (void)wVALUE;
  (void)wINDEX;

  return USB_ERROR;
}
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_LINE_CODING_SUPPORTED
/**
  * @brief  GET_LINE_CODING Class-specific packet handler sample ([2], 6.3.11).
  *
  * @param  wINDEX: Interface number
  *
  * @param  DATA: Pointer to USB_CDC_LineCoding_TypeDef structure that
  *         should hold current Line Coding information.
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummyGetLineCoding(uint16_t wINDEX, USB_CDC_LineCoding_TypeDef* DATA)
{
  (void)wINDEX;
  (void)DATA;

  return USB_ERROR;
}

/**
  * @brief  SET_LINE_CODING Class-specific packet handler sample ([2], 6.3.10).
  *
  * @param  wINDEX: Interface number
  *
  * @param  DATA: Pointer to USB_CDC_LineCoding_TypeDef structure
  *         that contains the Line Coding information.
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummySetLineCoding(uint16_t wINDEX, const USB_CDC_LineCoding_TypeDef* DATA)
{
  (void)wINDEX;
  (void)DATA;

  return USB_ERROR;
}
#endif /* USB_CDC_LINE_CODING_SUPPORTED */

#ifdef USB_CDC_CONTROL_LINE_STATE_SUPPORTED
/**
  * @brief  SET_CONTROL_LINE_STATE Class-specific packet handler sample ([2], 6.3.12).
  *
  * @param  wVALUE: Control Signal.
  *         This parameter can be any combination of the following values:
  *           @arg USB_CDC_DTR_PRESENT
  *           @arg USB_CDC_RTS_ACTIVATE_CARRIER
  *
  * @param  wINDEX: Interface number
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummyControlLineState(uint16_t wVALUE, uint16_t wINDEX)
{
  (void)wVALUE;
  (void)wINDEX;

  return USB_ERROR;
}
#endif /* USB_CDC_CONTROL_LINE_STATE_SUPPORTED */

#ifdef USB_CDC_LINE_BREAK_SUPPORTED
/**
  * @brief  SEND_BREAK Class-specific packet handler sample ([2], 6.3.13).
  *
  * @param  wVALUE: Duration of Break.
  *
  * @param  wINDEX: Interface number
  *
  * @retval USB_Result.
  */

USB_Result USB_CDC_DummySendBreak(uint16_t wVALUE, uint16_t wINDEX)
{
  (void)wVALUE;
  (void)wINDEX;

  return USB_ERROR;
}
#endif /* USB_CDC_LINE_BREAK_SUPPORTED */

/** @} */ /* End of group USB_CDC_Private_Dummy_Functions */

/** @} */ /* End of group USB_CDC_Private_Functions */

/** @} */ /* End of group USB_CDC */

/** @} */ /* End of group USB_DEVICE_AND_CDC */

/** @} */ /* End of group MDR32F9Qx_StdPeriph_Driver */

/*
*
* END OF FILE MDR32F9Qx_usb_CDC.c */

